{
  "Surface-based GLM analysis data": {
    "Description": "We utilized a single-trial General Linear Model (GLMsingle) (https://github.com/cvnlab/GLMsingle) approach, an advanced denoising approach in MATLAB R2019a, to model the pre-processed fMRI data from main experiment. For single trials, the method of GLM was developed to offer estimations of BOLD response magnitudes ('betas'). In this study, three betas were calculated by analyzing the BOLD response corresponding to individual video onset ranging from 1 to 3 seconds with 1-second intervals. We produced individual GLMsingle models for each session (consisted of 4 training runs and 2 test runs). In general, for each video within the training set, 2 (repetitions) x 3 (seconds) betas were acquired. Similarly, for each video within the testing set, 10 (repetitions) x 3 (seconds) betas were acquired. The utilization of repetitions enabled us to acquire video-evoked responses with a high signal-to-noise ratio (SNR).For the main experiment data, the file named “sub--<subID>_ses-<sesID>_task-<taskID>_betas_FITHRF_GLMDENOISE_RR.hdf5” with the beta values from the a scanning session from the GLMsingle. \nA “sub-<subID>_ses-<sesID>_task-<taskID>_FRACvalue.hdf5” file stores the fractional ridge regression regularization level chosen for each voxel of a scanning session . A “sub-<subID>_ses-<sesID>_task-<taskID>_HRFindex.hdf5” file stores the  the 1-index of the best hemodynamic response function of a scanning session. A “sub-<subID>_ses-<sesID>_task-<taskID>_R2.hdf5” file stores the model accuracy expressed in terms of R2 (percentage) of a scanning session.A “sub-<subID>_ses-<sesID>_task-<taskID>_R2run.hdf5” file stores  R2 separated by run. The betas after Z-score and repetition averaging were stored in a file named “sub-<subID>_task-face_betas_<test/train>.mat/h5”.Specifically, for each video within the training set, 2 (repetitions) x 3 (seconds) betas were acquired. Similarly, for each video within the testing set, 10 (repetitions) x 3 (seconds) betas are acquired. We average the 2 repetitions of the training set. Likewise, we average the 10 repetitions of the testing set. The results of train/ test are saved in“.hdf5”. A “sub-<subID>_ses-<sesID>_task-<taskID>_mean.mat” file stores the mean of the GLM analysis data for the pRF and fLoc experiments (Fig. 2g). "
  },
  "code": {
    "Description": "please visit: "NFED-fmri\validation\GLMsingle-main-experiment\matlab\main\NFED_GLMsingle.m"
  }
}
